#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_project_iam_member.user-sql-sa-role["dd"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-dev"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.user-sql-sa-role["fb"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-dev"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.user-sql-sa-role["jh"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-dev"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.user-sql-sa-role["mk"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-dev"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.user-sql-sa-role["mm"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-dev"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.user-sql-sa-role["ms"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-dev"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.user-sql-sa-role["my"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-dev"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.user-sql-sa-role["rc"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-dev"
      + role    = "roles/cloudsql.client"
    }

  # google_project_iam_member.user-sql-sa-role["sh"] will be created
  + resource "google_project_iam_member" "user-sql-sa-role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "broad-jade-dev"
      + role    = "roles/cloudsql.client"
    }

  # google_service_account.user-sql-service-account["dd"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "dd-proxy-sa"
      + display_name = "sqlproxy service account for dd namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user-sql-service-account["fb"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "fb-proxy-sa"
      + display_name = "sqlproxy service account for fb namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user-sql-service-account["jh"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "jh-proxy-sa"
      + display_name = "sqlproxy service account for jh namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user-sql-service-account["mk"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "mk-proxy-sa"
      + display_name = "sqlproxy service account for mk namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user-sql-service-account["mm"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "mm-proxy-sa"
      + display_name = "sqlproxy service account for mm namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user-sql-service-account["ms"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "ms-proxy-sa"
      + display_name = "sqlproxy service account for ms namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user-sql-service-account["my"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "my-proxy-sa"
      + display_name = "sqlproxy service account for my namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user-sql-service-account["rc"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "rc-proxy-sa"
      + display_name = "sqlproxy service account for rc namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.user-sql-service-account["sh"] will be created
  + resource "google_service_account" "user-sql-service-account" {
      + account_id   = "sh-proxy-sa"
      + display_name = "sqlproxy service account for sh namespace"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["dd"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXYzzZU=" -> (known after apply)
      ~ id                 = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          + "serviceAccount:broad-jade-dev.svc.id.goog[dd/dd-jade-gcloud-sqlproxy]",
          - "serviceAccount:broad-jade-dev.svc.id.goog[mk/mk-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["fb"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXYzzZU=" -> (known after apply)
      ~ id                 = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          + "serviceAccount:broad-jade-dev.svc.id.goog[fb/fb-jade-gcloud-sqlproxy]",
          - "serviceAccount:broad-jade-dev.svc.id.goog[mk/mk-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["jh"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXYzzZU=" -> (known after apply)
      ~ id                 = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          + "serviceAccount:broad-jade-dev.svc.id.goog[jh/jh-jade-gcloud-sqlproxy]",
          - "serviceAccount:broad-jade-dev.svc.id.goog[mk/mk-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["mk"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXYzzZU=" -> (known after apply)
      ~ id                 = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
        members            = [
            "serviceAccount:broad-jade-dev.svc.id.goog[mk/mk-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["mm"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXYzzZU=" -> (known after apply)
      ~ id                 = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          - "serviceAccount:broad-jade-dev.svc.id.goog[mk/mk-jade-gcloud-sqlproxy]",
          + "serviceAccount:broad-jade-dev.svc.id.goog[mm/mm-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["ms"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXYzzZU=" -> (known after apply)
      ~ id                 = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          - "serviceAccount:broad-jade-dev.svc.id.goog[mk/mk-jade-gcloud-sqlproxy]",
          + "serviceAccount:broad-jade-dev.svc.id.goog[ms/ms-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["my"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXYzzZU=" -> (known after apply)
      ~ id                 = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          - "serviceAccount:broad-jade-dev.svc.id.goog[mk/mk-jade-gcloud-sqlproxy]",
          + "serviceAccount:broad-jade-dev.svc.id.goog[my/my-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["rc"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXYzzZU=" -> (known after apply)
      ~ id                 = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          - "serviceAccount:broad-jade-dev.svc.id.goog[mk/mk-jade-gcloud-sqlproxy]",
          + "serviceAccount:broad-jade-dev.svc.id.goog[rc/rc-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_iam_binding.sqlproxy_workload_identity_binding["sh"] must be replaced
-/+ resource "google_service_account_iam_binding" "sqlproxy_workload_identity_binding" {
      ~ etag               = "BwWmFXYzzZU=" -> (known after apply)
      ~ id                 = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          - "serviceAccount:broad-jade-dev.svc.id.goog[mk/mk-jade-gcloud-sqlproxy]",
          + "serviceAccount:broad-jade-dev.svc.id.goog[sh/sh-jade-gcloud-sqlproxy]",
        ]
        role               = "roles/iam.workloadIdentityUser"
      ~ service_account_id = "projects/broad-jade-dev/serviceAccounts/proxy-sa@broad-jade-dev.iam.gserviceaccount.com" -> (known after apply) # forces replacement
    }

  # google_service_account_key.user-sql-sa-key["dd"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["fb"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["jh"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["mk"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["mm"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["ms"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["my"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["rc"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # google_service_account_key.user-sql-sa-key["sh"] will be created
  + resource "google_service_account_key" "user-sql-sa-key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # module.user-activity-sinks.google_project_iam_binding.bigquery-admin[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-admin" {
        etag    = "BwWmF01g8z4="
        id      = "broad-jade-dev/roles/bigquery.admin"
      ~ members = [
          - "group:jadeteam@broadinstitute.org",
          - "serviceAccount:jade-api-sa@broad-jade-dev.iam.gserviceaccount.com",
            "serviceAccount:p970791974390-502312@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "broad-jade-dev"
        role    = "roles/bigquery.admin"
    }

Plan: 36 to add, 1 to change, 9 to destroy.

Warning: Quoted references are deprecated

  on .terraform/modules/dns-set/terraform-modules/external-dns/dns.tf line 6, in data "google_dns_managed_zone" "dns_zone":
   6:     provider     = "google.targetdns"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and 3 more similar warnings elsewhere)

```

</details>

*Workflow: `Terraform GitHub Actions to validate/plan TF files`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
